---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PointFlexibleShowNumber
source: html/d0763e16-fe2c-c0d8-a659-4c1dfc516c14.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PointFlexibleShowNumber Property

"Show Placement Number"

## Syntax (C#)
```csharp
public static ForgeTypeId PointFlexibleShowNumber { get; }
```